<a href="https://colab.research.google.com/github/bbodhak/Python/blob/master/Asgn_6_DataCleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
'''
2.Problem Statement
It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).
2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.
3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)
4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.
5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.
'''

'\n2.Problem Statement\nIt happens all the time: someone gives you data containing malformed strings,\nPython, lists and missing data. How do you tidy it up so you can get on with the\nanalysis?\nTake this monstrosity as the DataFrame to use in the following puzzles:\ndf = pd.DataFrame({\'From_To\': [\'LoNDon_paris\', \'MAdrid_miLAN\',\n\'londON_StockhOlm\',\n\n\'Budapest_PaRis\', \'Brussels_londOn\'],\n\'FlightNumber\': [10045, np.nan, 10065, np.nan, 10085],\n\'RecentDelays\': [[23, 47], [], [24, 43, 87], [13], [67, 32]],\n\'Airline\': [\'KLM(!)\', \'<Air France> (12)\', \'(British Airways. )\',\n\'12. Air France\', \'"Swiss Air"\']})\n\n1. Some values in the the FlightNumber column are missing. These numbers are\nmeant to increase by 10 with each row so 10055 and 10075 need to be put in\nplace. Fill in these missing numbers and make the column an integer column\n(instead of a float column).\n2. The From_To column would be better as two separate columns! Split each\nstring on the underscore delimiter _ to give a new temporary DataFrame with\nthe correct values. Assign the correct column names to this temporary\nDataFrame.\n3. Notice how the capitalisation of the city names is all mixed up in this\ntemporary DataFrame. Standardise the strings so that only the first letter is\nuppercase (e.g. "londON" should become "London".)\n4. Delete the From_To column from df and attach the temporary DataFrame\nfrom the previous questions.\n5. In the RecentDelays column, the values have been entered into the\nDataFrame as a list. We would like each first value in its own column, each\n\nsecond value in its own column, and so on. If there isn\'t an Nth value, the value\nshould be NaN.\nExpand the Series of lists into a DataFrame named delays, rename the columns\ndelay_1, delay_2, etc. and replace the unwanted RecentDelays column in df\nwith delays.\n'

Getting the dataframe

In [3]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
'''1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).
'''
df['FlightNumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [5]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [6]:
'''
2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.
'''
tdf = df.copy()
new = tdf["From_To"].str.split("_", n = 1, expand = True) 
tdf["From"]= new[0] 
  
# making separate last name column from new data frame 
tdf["To"]= new[1] 

# df display 
tdf

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris         10045  ...    LoNDon      paris
1      MAdrid_miLAN         10055  ...    MAdrid      miLAN
2  londON_StockhOlm         10065  ...    londON  StockhOlm
3    Budapest_PaRis         10075  ...  Budapest      PaRis
4   Brussels_londOn         10085  ...  Brussels     londOn

[5 rows x 6 columns]

In [7]:
'''
3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)
# '''
# # tdf = tdf.applymap(lambda s:s.str.capitalize() if type(s) == str else s)
# # tdf['From']
# # df[['one', 'two', 'three']] = df[['one', 'two', 'three']].astype(str)
# tdf['From_To','Airline','From','To'].apply(lambda x: x.capitalize())
# # df['A'].apply(lambda x: x.capitalize()) 
# all_columns = list(tdf) # Creates list of all column headers
# tdf[all_columns] = tdf[all_columns].str.capitalize()
tdf['From'] = tdf['From'].str.capitalize()
tdf['To'] = tdf['To'].str.capitalize()

tdf

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris         10045  ...    London      Paris
1      MAdrid_miLAN         10055  ...    Madrid      Milan
2  londON_StockhOlm         10065  ...    London  Stockholm
3    Budapest_PaRis         10075  ...  Budapest      Paris
4   Brussels_londOn         10085  ...  Brussels     London

[5 rows x 6 columns]

In [8]:
'''
4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.
'''
df.drop(columns =["From_To"], inplace = True)
df['From']=tdf['From']
df['To']=tdf['To']
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [9]:
'''
5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.
'''
# there are several ways to do this, but the following approach is possibly the simplest

delays = df['RecentDelays'].apply(pd.Series)

delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]

df = df.drop('RecentDelays', axis=1).join(delays)

df

   FlightNumber              Airline      From  ... delay_1  delay_2  delay_3
0         10045               KLM(!)    London  ...    23.0     47.0      NaN
1         10055    <Air France> (12)    Madrid  ...     NaN      NaN      NaN
2         10065  (British Airways. )    London  ...    24.0     43.0     87.0
3         10075       12. Air France  Budapest  ...    13.0      NaN      NaN
4         10085          "Swiss Air"  Brussels  ...    67.0     32.0      NaN

[5 rows x 7 columns]